export const sampleBooks = [
  {
    id: "1",
    title: "The Great Gatsby",
    author: "F. Scott Fitzgerald",
    year: 1925,
    cover: "/covers/1.jpg",
    isbn: "9780743273565",
    description: "A classic novel of the Jazz Age",
    textContentUrl: "/books/TheGreatGatsby.txt"
  },
  {
    id: "2",
    title: "Nightwork", 
    author: "Irwin Shaw",
    year: 1976,
    cover: "/covers/2.jpg",
    isbn: "9780440164609",
    description: "Douglas Grimes, penniless ex-pilot, is waiting for the future to start living again. A fortune in cash by a dead body in New York City brings opportunity. Miles Fabian, debonair, jet-set con-man, shows the way.... Fast cars, fancy hotels, fancier woman. St Moritz, Paris, Florence, Rome Racehorses, blue movies, gambling, gold. Wild and woolly schemes, all wonderfully profitable. But the day of reckoning must dawn. Who will appear to claim the stolen money? And when?",
    textContentUrl: "/books/2.txt"
  },
  {
    id: "3",
    title: "Пересмешник", 
    author: "Алексей Пехов",
    year: 2009,
    cover: "/covers/3.jpg",
    isbn: "978-5-9922-0419-3",
    description: "Добро пожаловать в Рапгар! Просвещенную столицу цивилизованного мира, город тысячи народов, королевство страстей, вселенную пара и магии. Царство, в котором живут бок о бок лучшие люди и самые страшные чудовища из тьмы. Древняя столица страны — город множества историй, каждая из которых является не менее реальной, чем ваша, и повествует о чьей-то жизни, полной любви, ненависти и приключений. Например, такой, как у чэра Тиля эр’Картиа, по прозвищу Пересмешник, который, к своему несчастью, оказался в неудачное время не в том месте, из-за чего его судьба изменилась раз и навсегда.",
    textContentUrl: "/books/3.txt"
  },
  {
    id: "4",
    title: "Заклинатели", 
    author: "Алексей Пехов",
    year: 2011,
    cover: "/covers/4.jpg",
    isbn: "978-5-9922-0904-4",
    description: "Они те, кто задувает огонь в наших очагах. Те, кто скрипит половицами в старых домах. Они живут в дуплах мертвых деревьев, пищат мышиными голосами и смотрят из провалившихся окон разрушенных храмов. Они — духи, правящие этим миром, а люди лишь помеха для их шалостей, игрушки в их руках… Они смеются над нами, но опасаются тех, кого называют заклинателями.",
    textContentUrl: "/books/4.txt"
  },
  {
    id: "5",
    title: "Ловушка для духа", 
    author: "Алексей Пехов",
    year: 2014,
    cover: "/covers/5.jpg",
    isbn: "978-5-9922-1694-3",
    description: "Они те, кто живет под землей, в воздухе, воде и огне. Те, кто крадет наши мысли и блуждает по снам, питается нашими страхами и желаниями. Ложь, правда, явь, кошмары и вымысел подчиняются им. Истинным правителям этого мира. Самые сильные – пытаются противостоять. Слабые – бегут или умирают. Но никогда на их пути не встречался тот, кто способен понять. Чтобы договориться с ними.",
    textContentUrl: "/books/5.txt"
  },
  {
    id: "6",
    title: "Ловцы удачи", 
    author: "Алексей Пехов",
    year: 2012,
    cover: "/covers/6.jpg",
    isbn: "978-5-9922-1069-9",
    description: "Сложно убежать от своего прошлого. Для этого придется преодолеть множество трудностей и оказаться на другом конце света, в стране теплого солнца, ласкового океана и тропических островов. Где небо бороздят воздушные пираты и лихие капитаны, процветает разбой и контрабанда, рекой льется ром и все уважают летунов.В мире на границе Изнанки всех ловцов удачи ждут головокружительные приключения и чудеса на виражах.",
    textContentUrl: "/books/6.txt"
  },
  {
    id: "7",
    title: "Верные враги", 
    author: "Ольга Громыко",
    year: 2005,
    cover: "/covers/7.jpg",
    isbn: "978-5-9922-0027-0",
    description: "Это – сказка, рассказанная зимней ночью. Веселое и грустное повествование о вражде и дружбе, магии и смекалке, благородстве и предательстве, любви и ненависти, между которыми один шаг по глубокому снегу. Это – кусочек белорусской истории, не попавший в летопись, но воспетый в легендах. А что в ней ложь и что правда – пусть останется на совести автора…",
    textContentUrl: "/books/7.txt"
  },
  {
    id: "8",
    title: "Волшебник Земноморья", 
    author: "Урсула Ле Гуин",
    year: 1968,
    cover: "/covers/8.jpg",
    isbn: "978-5-699-12839-6",
    description: "Это история Геда, самоучки из глухой деревушки на самой окраине Земноморского архипелага, ставшего величайшим волшебником всего Земноморья. Но прежде начинающему волшебнику Геду предстоит спасти свою деревню от пиратов, пройти курс Академии Волшебства, едва не погибнуть, отпустив на волю свою тень, и пережить множество приключений в разных краях Земноморья.",
    textContentUrl: "/books/8.txt"
  },
  {
    id: "9",
    title: "Гробницы Атуана", 
    author: "Урсула Ле Гуин",
    year: 1970,
    cover: "/covers/8.jpg",
    isbn: "5-17-024528-9",
    description: "Роман «Гробницы Атуана» (1969)входит в знаменитую сказочную тетралогию писательницы «Волшебник Земноморья». Они объединены общими действующими героями – это жрица Тенар и Великий Маг – Гед. В первом романе волшебник Гед спасет совсем юную Тенар, служащую Великим Силам Тьмы, из подземелья, где она обречена провести всю жизнь. Книга Урсулы Ле Гуин – это история Геда, самоучки из глухой деревушки на самой окраине Земноморского архипелага, ставшего величайшим волшебником всего Земноморья. Но прежде начинающему волшебнику Геду предстоит спасти свою деревню от пиратов, пройти курс Академии Волшебства, едва не погибнуть, отпустив на волю свою тень, и пережить множество приключений в разных краях Земноморья – удивительной страны Урсулы ле Гуин – выдающейся американской писательницы, лауреата многочисленных литературных премий, доктора философии, создавшей сказочно-фантастическую эпопею, одинаково интересную и детям и взрослым. Сказочно-фантастическое повествование Ле Гуин населяют маги, драконы, ведьмы, древние и загадочные существа, неведомые силы воды, земли и воздуха. Эта захватывающая книга построена на хитросплетении фантазий. Однако она поднимает вполне реальные проблемы мужания и становления личности, предлагает молодому читателю самому разобраться, что есть Свет и что есть Тьма, и где та грань, за которой эти два понятия сливаются воедино. Первый же роман знаменитого цикла о Земноморье поставил Урсулу Ле Гуин в ряды выдающихся мастеров фэнтези, наряду с Дж. Р. Р. Толкиеном и К. Льюисом. В замысловатом лабиринте сказочной страны Земноморье немудрено и заблудиться, но ведомому фантазией и талантом Урсулы Ле Гуин читателю не грозит столь незавидная участь. Продуманный до мелочей, раскрашенный сочными красками мир заключает в себе неповторимое обаяние, под власть которого уже попали миллионы любителей фантастики во всем мире",
    textContentUrl: "/books/9.txt"
  },
  {
    id: "10",
    title: "На последнем берегу", 
    author: "Урсула Ле Гуин",
    year: 1972,
    cover: "/covers/8.jpg",
    isbn: "978-5-9922-0419-3 ",
    description: "Магия Земноморья угасает, краски жизни тускнеют. Один из магов преступил все запреты и саму грань между жизнью и смертью — кто он, обещающий вечную жизнь по ту сторону? Выяснить это надо Геду. В сопровождении юного принца Аррена, ему предстоит доплыть до края мира, и вступить во владения смерти.",
    textContentUrl: "/books/10.txt"
  },
];